In [1]:
# Supress Warnings

import warnings
warnings.filterwarnings('ignore')

In [2]:
# Import the numpy and pandas packages

import numpy as np
import pandas as pd

# CHECK POINT 1 :
### Import and read

In [3]:
# load companies file into python 
companies = pd.read_csv(r"C:/Users/haric/Downloads/companies.txt", sep="\t",encoding="ANSI")
companies.shape

(66368, 10)

In [4]:
#removing special characters from the column permalink and name in companies file 
companies['permalink']= companies.permalink.str.encode('utf-8').str.decode('ascii','ignore')
companies['name'] = companies.name.str.encode('utf-8').str.decode('ascii','ignore')
companies.head()

,permalink,name,homepage_url,category_list,status,country_code,state_code,region,city,founded_at
0,/Organization/-Fame,#fame,http://livfame.com,Media,operating,IND,16,Mumbai,Mumbai,NaN
1,/Organization/-Qounter,:Qounter,http://www.qounter.com,Application Platforms|Real Time|Social Network...,operating,USA,DE,DE - Other,Delaware City,04-09-2014
2,/Organization/-The-One-Of-Them-Inc-,"(THE) ONE of THEM,Inc.",http://oneofthem.jp,Apps|Games|Mobile,operating,NaN,NaN,NaN,NaN,NaN
3,/Organization/0-6-Com,0-6.com,http://www.0-6.com,Curated Web,operating,CHN,22,Beijing,Beijing,01-01-2007
4,/Organization/004-Technologies,004 Technologies,http://004gmbh.de/en/004-interact,Software,operating,USA,IL,"Springfield, Illinois",Champaign,01-01-2010

In [5]:
#importing data from csv into data frame round2
round2 = pd.read_csv(r"C:/Users/haric/Downloads/rounds2.csv", sep =",",encoding ="ANSI")
round2.shape

(114949, 6)

In [6]:
#removing special characters in company permalink column
round2['company_permalink'] = round2.company_permalink.str.encode('utf-8').str.decode('ascii','ignore')
round2.head()

,company_permalink,funding_round_permalink,funding_round_type,funding_round_code,funded_at,raised_amount_usd
0,/organization/-fame,/funding-round/9a01d05418af9f794eebff7ace91f638,venture,B,05-01-2015,10000000.0
1,/ORGANIZATION/-QOUNTER,/funding-round/22dacff496eb7acb2b901dec1dfe5633,venture,A,14-10-2014,NaN
2,/organization/-qounter,/funding-round/b44fbb94153f6cdef13083530bb48030,seed,NaN,01-03-2014,700000.0
3,/ORGANIZATION/-THE-ONE-OF-THEM-INC-,/funding-round/650b8f704416801069bb178a1418776b,venture,B,30-01-2014,3406878.0
4,/organization/0-6-com,/funding-round/5727accaeaa57461bd22a9bdd945382d,venture,A,19-03-2008,2000000.0

Data cleaning: droping columns and rows 
How many unique companies are present in rounds2?

In [7]:
companies = companies.drop(['state_code','region','city','founded_at'],axis =1)

In [8]:
companies['permalink']=companies['permalink'].str.upper()

In [9]:
companies = companies.drop_duplicates()

In [10]:
len(companies['permalink'].unique().tolist())

66368

How many unique companies are present in the companies file?

In [11]:
round2= round2.drop(['funding_round_code','funded_at'],axis=1)

In [12]:
round2 = round2.drop_duplicates()

In [13]:
round2['company_permalink']= round2['company_permalink'].str.upper()

In [14]:
len(round2['company_permalink'].unique().tolist())

66368

In [15]:
round2.shape

(114949, 4)

In [16]:
round2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 114949 entries, 0 to 114948
Data columns (total 4 columns):
company_permalink          114949 non-null object
funding_round_permalink    114949 non-null object
funding_round_type         114949 non-null object
raised_amount_usd          94959 non-null float64
dtypes: float64(1), object(3)
memory usage: 4.4+ MB

In [17]:
result =companies.isin(round2)
len(result)

66368

In [18]:
companies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66368 entries, 0 to 66367
Data columns (total 6 columns):
permalink        66368 non-null object
name             66367 non-null object
homepage_url     61310 non-null object
category_list    63220 non-null object
status           66368 non-null object
country_code     59410 non-null object
dtypes: object(6)
memory usage: 3.5+ MB

In [19]:
companies.describe()

,permalink,name,homepage_url,category_list,status,country_code
count,66368,66367,61310,63220,66368,59410
unique,66368,66102,61191,27296,4,137
top,/ORGANIZATION/BLACK-RAVEN-AND-STAG,Blink,http://www.askforoffer.com,Software,operating,USA
freq,1,4,5,3995,53034,37601

Merge the two data frames so that all  variables (columns)  in the companies frame are added to the rounds2 data frame. Name the merged frame master_frame. How many observations are present in master_frame ?

In [20]:
master_frame = pd.merge(round2,companies,right_on='permalink',left_on='company_permalink',how='left')
master_frame.shape

(114949, 10)

In [21]:
master_frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 114949 entries, 0 to 114948
Data columns (total 10 columns):
company_permalink          114949 non-null object
funding_round_permalink    114949 non-null object
funding_round_type         114949 non-null object
raised_amount_usd          94959 non-null float64
permalink                  114949 non-null object
name                       114948 non-null object
homepage_url               108815 non-null object
category_list              111539 non-null object
status                     114949 non-null object
country_code               106271 non-null object
dtypes: float64(1), object(9)
memory usage: 9.6+ MB

# Checkpoint 2
## Funding type Analysis

In [22]:
# Get the column-wise Null count using 'is.null()' alongwith the 'sum()' function
round(100*(master_frame.isnull().sum()/len(master_frame.index)),2)

company_permalink           0.00
funding_round_permalink     0.00
funding_round_type          0.00
raised_amount_usd          17.39
permalink                   0.00
name                        0.00
homepage_url                5.34
category_list               2.97
status                      0.00
country_code                7.55
dtype: float64

In [23]:
#drop all the rows with NaNs at this column using the
# 'isnan' function of NumPy alongwith a negation '~'
master_frame = master_frame[~np.isnan(master_frame['raised_amount_usd'])]

In [24]:
# Get the percentages by dividing the sum obtained previously by the total length, multiplying it by 100 and rounding it off to
# two decimal places
round(100*(master_frame.isnull().sum()/len(master_frame.index)),2)

company_permalink          0.00
funding_round_permalink    0.00
funding_round_type         0.00
raised_amount_usd          0.00
permalink                  0.00
name                       0.00
homepage_url               4.56
category_list              1.10
status                     0.00
country_code               6.16
dtype: float64

In [25]:
# Inspect the dataset.
master_frame.shape

(94959, 10)

In [26]:
#finding the avg funding type 
avg_funding_type=master_frame.pivot_table(values =['raised_amount_usd'],index = 'funding_round_type',aggfunc = 'mean').sort_values(by = ['raised_amount_usd'],ascending = False)

In [27]:
#converting raised amount usd to million $ and rounding off to 2 decimal places
avg_funding_type['raised_amount_usd'] =avg_funding_type['raised_amount_usd'].apply(lambda x: x/1000000)

avg_funding_type['raised_amount_usd']= avg_funding_type['raised_amount_usd'].apply(lambda x: round(x,2))
avg_funding_type.sort_values(by = 'raised_amount_usd', ascending = False)

                       raised_amount_usd
funding_round_type
post_ipo_debt                     168.70
post_ipo_equity                    82.18
secondary_market                   79.65
private_equity                     73.31
undisclosed                        19.24
debt_financing                     17.04
venture                            11.75
grant                               4.30
convertible_note                    1.45
product_crowdfunding                1.36
angel                               0.96
seed                                0.72
equity_crowdfunding                 0.54
non_equity_assistance               0.41

In [28]:
#finding only the top four avg funding round and showing it as a pivot table
avg_funding_type = avg_funding_type.loc[['venture','angel','seed','private_equity']]
avg_funding_type.sort_values(by = 'raised_amount_usd', ascending = False)

                    raised_amount_usd
funding_round_type
private_equity                  73.31
venture                         11.75
angel                            0.96
seed                             0.72

# Checkpoint 3
### Country Analysis

In [29]:
#create a data frame where funding type is ventura
top9_sec = master_frame.loc[master_frame.funding_round_type == 'venture']

top9_sec.sort_values(by='raised_amount_usd',ascending = False,inplace = True)
top9_sec.shape

(50228, 10)

In [30]:
#calculate top 9 countries to invest and consider only english speaking countries 
top9 = top9_sec.groupby(['country_code']).sum().sort_values('raised_amount_usd',ascending = False)[:9]
top9['raised_amount_usd'] = top9['raised_amount_usd'].apply(lambda x: x/1000000)
top9['raised_amount_usd'] = top9['raised_amount_usd'].apply(lambda x: round(x,2))
top9

              raised_amount_usd
country_code
USA                   422510.84
CHN                    39835.42
GBR                    20245.63
IND                    14391.86
CAN                     9583.33
FRA                     7259.54
ISR                     6907.51
DEU                     6346.96
JPN                     3363.68

# Checkpoint 4
### Sector Analysis 1

In [31]:
#importing data from mapping file 
mapping = pd.read_csv(r"C:/Users/haric/Downloads/mapping.csv",sep = ',',encoding ='ANSI')

mapping.shape

(688, 10)

In [32]:
#removing null values from category list in mapping file
mapping = mapping[mapping.category_list.notnull()]
#replacing the errors on names in category list 
mapping['category_list'] = mapping['category_list'].apply(lambda x: x.replace('0','na') if ('2.0' not in x) else x)

#changing to lower case 
mapping['category_list'] = mapping['category_list'].str.lower()
mapping.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 687 entries, 1 to 687
Data columns (total 10 columns):
category_list                              687 non-null object
Automotive & Sports                        687 non-null int64
Blanks                                     687 non-null int64
Cleantech / Semiconductors                 687 non-null int64
Entertainment                              687 non-null int64
Health                                     687 non-null int64
Manufacturing                              687 non-null int64
News, Search and Messaging                 687 non-null int64
Others                                     687 non-null int64
Social, Finance, Analytics, Advertising    687 non-null int64
dtypes: int64(9), object(1)
memory usage: 59.0+ KB

In [33]:
# with the business rule that the first string before the vertical bar will be considered the primary sector.
#Extract the primary sector of each category list from the category_list column
master_frame['primary_sector']= master_frame['category_list'].str.split('|',1).str[0]
master_frame.head()

,company_permalink,funding_round_permalink,funding_round_type,raised_amount_usd,permalink,name,homepage_url,category_list,status,country_code,primary_sector
0,/ORGANIZATION/-FAME,/funding-round/9a01d05418af9f794eebff7ace91f638,venture,10000000.0,/ORGANIZATION/-FAME,#fame,http://livfame.com,Media,operating,IND,Media
2,/ORGANIZATION/-QOUNTER,/funding-round/b44fbb94153f6cdef13083530bb48030,seed,700000.0,/ORGANIZATION/-QOUNTER,:Qounter,http://www.qounter.com,Application Platforms|Real Time|Social Network...,operating,USA,Application Platforms
3,/ORGANIZATION/-THE-ONE-OF-THEM-INC-,/funding-round/650b8f704416801069bb178a1418776b,venture,3406878.0,/ORGANIZATION/-THE-ONE-OF-THEM-INC-,"(THE) ONE of THEM,Inc.",http://oneofthem.jp,Apps|Games|Mobile,operating,NaN,Apps
4,/ORGANIZATION/0-6-COM,/funding-round/5727accaeaa57461bd22a9bdd945382d,venture,2000000.0,/ORGANIZATION/0-6-COM,0-6.com,http://www.0-6.com,Curated Web,operating,CHN,Curated Web
6,/ORGANIZATION/01GAMES-TECHNOLOGY,/funding-round/7d53696f2b4f607a2f2a8cbb83d01839,undisclosed,41250.0,/ORGANIZATION/01GAMES-TECHNOLOGY,01Games Technology,http://www.01games.hk/,Games,operating,HKG,Games

In [34]:
#converting the columns to rows using melt fun
wide_to_long_df = pd.melt(mapping,id_vars = ['category_list'],var_name = 'sectors',value_name = 'main_sectors')
wide_to_long_df.head(20)

            category_list              sectors  main_sectors
0                      3d  Automotive & Sports             0
1             3d printing  Automotive & Sports             0
2           3d technology  Automotive & Sports             0
3              accounting  Automotive & Sports             0
4        active lifestyle  Automotive & Sports             0
5            ad targeting  Automotive & Sports             0
6      advanced materials  Automotive & Sports             0
7        adventure travel  Automotive & Sports             1
8             advertising  Automotive & Sports             0
9   advertising exchanges  Automotive & Sports             0
10   advertising networks  Automotive & Sports             0
11  advertising platforms  Automotive & Sports             0
12                 advice  Automotive & Sports             0
13              aerospace  Automotive & Sports             1
14            agriculture  Automotive & Sports             0
15  air pollution control  Automotive & Sports             0
16             algorithms  Automotive & Sports             0
17            all markets  Automotive & Sports             0
18           all students  Automotive & Sports             0
19   alternative medicine  Automotive & Sports             0

In [35]:
#choosing only the values coresponding to sector
main_sector = wide_to_long_df.loc[wide_to_long_df.main_sectors !=0]
main_sector.head(5)

       category_list              sectors  main_sectors
7   adventure travel  Automotive & Sports             1
13         aerospace  Automotive & Sports             1
44              auto  Automotive & Sports             1
45   automated kiosk  Automotive & Sports             1
46        automotive  Automotive & Sports             1

In [36]:
#mapping master frame and mapping files
master_frame['primary_sector'] = master_frame['primary_sector'].str.lower()
master_frame['main_sector'] = master_frame.primary_sector.map(main_sector.set_index('category_list').sectors)
master_frame.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 94959 entries, 0 to 114948
Data columns (total 12 columns):
company_permalink          94959 non-null object
funding_round_permalink    94959 non-null object
funding_round_type         94959 non-null object
raised_amount_usd          94959 non-null float64
permalink                  94959 non-null object
name                       94958 non-null object
homepage_url               90627 non-null object
category_list              93915 non-null object
status                     94959 non-null object
country_code               89108 non-null object
primary_sector             93915 non-null object
main_sector                93847 non-null object
dtypes: float64(1), object(11)
memory usage: 9.4+ MB

# Checkpoint 5
### Sector Analysis 2

In [37]:
#Create a separate data frames D1, top 1 countrie containing the observations of funding type FT falling within the 5-15 million USD range.  1
D1 = master_frame.loc[(master_frame.funding_round_type == 'venture') & (master_frame.country_code =='USA') & ((master_frame.raised_amount_usd >=5000000) & (master_frame.raised_amount_usd<=15000000))]

D1['raised_amount_usd'] = D1['raised_amount_usd'].apply(lambda x:x/1000000)
D1['raised_amount_usd'] = D1['raised_amount_usd'].apply(lambda x: round(x,2))

In [38]:
#The total number (or count) of investments for each main sector in a separate column,
sec_investment_cnt1 = D1.pivot_table(values = 'raised_amount_usd',index ='main_sector',aggfunc = 'count').sort_values('raised_amount_usd',ascending = False)
#The total amount invested in each main sector in a separate column
sec_investment_sum1 = D1.pivot_table(values = 'raised_amount_usd', index = 'main_sector', aggfunc ='sum').sort_values('raised_amount_usd',ascending = False)

In [39]:
sec_investment_cnt1 = sec_investment_cnt1.rename(columns = {'raised_amount_usd' : 'sec_investment_cnt'})
sec_investment_sum1 = sec_investment_sum1.rename(columns = {'raised_amount_usd' : 'sec_investment_sum'})

In [40]:
D1 =pd.merge(D1,sec_investment_cnt1,on = 'main_sector',how = 'inner')
D1 =pd.merge(D1,sec_investment_sum1,on = 'main_sector', how = 'inner')

In [41]:
D1.shape

(12063, 14)

In [42]:
##Create a separate data frames D2, top 2 countries containing the observations of funding type FT falling within the 5-15 million USD range.  1
D2 = master_frame.loc[(master_frame.funding_round_type == 'venture')& (master_frame.country_code == 'GBR') & (master_frame.raised_amount_usd >= 5000000) & (master_frame.raised_amount_usd <= 15000000)]
D2['raised_amount_usd'] = D2['raised_amount_usd'].apply(lambda x : x/1000000)
D2['raised_amount_usd'] = D2['raised_amount_usd'].apply(lambda x : round(x,2))

sec_investment_cnt2 = D2.pivot_table(values = 'raised_amount_usd',index ='main_sector',aggfunc = 'count')
sec_investment_sum2 = D2.pivot_table(values = 'raised_amount_usd', index = 'main_sector', aggfunc ='sum')

In [43]:
sec_investment_cnt2 = sec_investment_cnt2.rename(columns = {'raised_amount_usd' : 'sec_investment_cnt'})
sec_investment_sum2 = sec_investment_sum2.rename(columns = {'raised_amount_usd':'sec_investment_sum'})

In [44]:
D2= pd.merge(D2,sec_investment_cnt2,on = 'main_sector',how = 'inner')
D2 = pd.merge(D2,sec_investment_sum2,on='main_sector', how = 'inner')
D2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 621 entries, 0 to 620
Data columns (total 14 columns):
company_permalink          621 non-null object
funding_round_permalink    621 non-null object
funding_round_type         621 non-null object
raised_amount_usd          621 non-null float64
permalink                  621 non-null object
name                       621 non-null object
homepage_url               592 non-null object
category_list              621 non-null object
status                     621 non-null object
country_code               621 non-null object
primary_sector             621 non-null object
main_sector                621 non-null object
sec_investment_cnt         621 non-null int64
sec_investment_sum         621 non-null float64
dtypes: float64(2), int64(1), object(11)
memory usage: 72.8+ KB

In [45]:
##Create a separate data frames D3, top 3 countries containing the observations of funding type FT falling within the 5-15 million USD range. 
D3 = master_frame.loc[(master_frame.funding_round_type == 'venture')& (master_frame.country_code == 'IND') & (master_frame.raised_amount_usd >= 5000000) & (master_frame.raised_amount_usd <= 15000000)]

In [46]:
D3['raised_amount_usd'] = D3['raised_amount_usd'].apply(lambda x : x/1000000)
D3['raised_amount_usd'] = D3['raised_amount_usd'].apply(lambda x : round(x,2))

In [47]:
sec_investment_cnt3 = D3.pivot_table(values = 'raised_amount_usd',index ='main_sector',aggfunc = 'count')
sec_investment_sum3 = D3.pivot_table(values = 'raised_amount_usd', index = 'main_sector', aggfunc ='sum')
sec_investment_cnt3 = sec_investment_cnt3.rename(columns = {'raised_amount_usd' : 'sec_investment_cnt'})
sec_investment_sum3 = sec_investment_sum3.rename(columns = {'raised_amount_usd' : 'sec_investment_sum'})

In [48]:

D3= pd.merge(D3,sec_investment_cnt3,on = 'main_sector',how = 'inner')
D3 = pd.merge(D3,sec_investment_sum3,on='main_sector',how='inner')
D3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 328 entries, 0 to 327
Data columns (total 14 columns):
company_permalink          328 non-null object
funding_round_permalink    328 non-null object
funding_round_type         328 non-null object
raised_amount_usd          328 non-null float64
permalink                  328 non-null object
name                       328 non-null object
homepage_url               325 non-null object
category_list              328 non-null object
status                     328 non-null object
country_code               328 non-null object
primary_sector             328 non-null object
main_sector                328 non-null object
sec_investment_cnt         328 non-null int64
sec_investment_sum         328 non-null float64
dtypes: float64(2), int64(1), object(11)
memory usage: 38.4+ KB

#### Total number of Investments (count) for country C1= 'USA',C2 = 'GBR',C3='IND'

In [49]:
sec_investment_cnt1.sum()

sec_investment_cnt    12063
dtype: int64

In [50]:
sec_investment_sum1.sum()

sec_investment_sum    107757.2
dtype: float64

In [51]:
sec_investment_cnt2.sum()

sec_investment_cnt    621
dtype: int64

In [52]:
sec_investment_sum2.sum()

sec_investment_sum    5379.07
dtype: float64

In [53]:
sec_investment_cnt3.sum()

sec_investment_cnt    328
dtype: int64

In [54]:
sec_investment_sum3.sum()

sec_investment_sum    2949.55
dtype: float64

### For point 3 (top sector count-wise), which company received the highest investment?

In [55]:
#sorting values based on investment by top country c1 for main sectors
sec_investment_cnt1.sort_values(by = 'sec_investment_cnt',ascending = False)

                                         sec_investment_cnt
main_sector
Others                                                 2950
Social, Finance, Analytics, Advertising                2714
Cleantech / Semiconductors                             2350
News, Search and Messaging                             1583
Health                                                  909
Manufacturing                                           799
Entertainment                                           591
Automotive & Sports                                     167

In [56]:
##sorting values based on investment by top country c2 for sectors
sec_investment_cnt2.sort_values(by = 'sec_investment_cnt', ascending = False )

                                         sec_investment_cnt
main_sector
Others                                                  147
Social, Finance, Analytics, Advertising                 133
Cleantech / Semiconductors                              130
News, Search and Messaging                               73
Entertainment                                            56
Manufacturing                                            42
Health                                                   24
Automotive & Sports                                      16

In [57]:
##sorting values based on investment by top country c3 for sectors
sec_investment_cnt3.sort_values(by = 'sec_investment_cnt', ascending = False )

                                         sec_investment_cnt
main_sector
Others                                                  110
Social, Finance, Analytics, Advertising                  60
News, Search and Messaging                               52
Entertainment                                            33
Manufacturing                                            21
Cleantech / Semiconductors                               20
Health                                                   19
Automotive & Sports                                      13

In [58]:
#company received highest investment in  top sector and in country c1
top_company_investment1 = D1.loc[(D1.main_sector == 'Others')]
top_company_investment1 = top_company_investment1.pivot_table(values = 'raised_amount_usd', index = ['name','permalink'], aggfunc = 'sum').sort_values(by = 'raised_amount_usd',ascending = False)
top_company_investment1[:10]

                                                       raised_amount_usd
name                permalink
Virtustream         /ORGANIZATION/VIRTUSTREAM                      64.30
Capella Photonics   /ORGANIZATION/CAPELLA                          54.97
AirTight Networks   /ORGANIZATION/AIRTIGHT-NETWORKS                54.20
deCarta             /ORGANIZATION/DECARTA                          52.10
Black Duck Software /ORGANIZATION/BLACK-DUCK-SOFTWARE              51.00
Approva             /ORGANIZATION/APPROVA                          50.10
Five9               /ORGANIZATION/FIVE9                            49.60
Bit9                /ORGANIZATION/BIT9                             48.43
Aryaka Networks     /ORGANIZATION/ARYAKA-NETWORKS                  48.17
BTI Systems         /ORGANIZATION/BTI-SYSTEMS                      48.00

In [59]:
top_company_investment2 = D2.loc[(D2.main_sector == 'Others')]
top_company_investment2 = top_company_investment2.pivot_table(values = 'raised_amount_usd', index = ['name','permalink'], aggfunc = 'sum').sort_values(by = 'raised_amount_usd',ascending = False)
top_company_investment2[:10]

                                                               raised_amount_usd
name                    permalink
Electric Cloud          /ORGANIZATION/ELECTRIC-CLOUD                       37.00
SenSage                 /ORGANIZATION/SENSAGE                              36.25
Enigmatec               /ORGANIZATION/ENIGMATIC                            32.50
SilverRail Technologies /ORGANIZATION/SILVERRAIL-TECHNOLOGIES              29.00
OpenCloud               /ORGANIZATION/OPENCLOUD                            27.97
MyOptique Group         /ORGANIZATION/MYOPTIQUE-GROUP                      27.70
Notonthehighstreet      /ORGANIZATION/NOTONTHEHIGHSTREET                   26.90
ACS Clothing            /ORGANIZATION/ACS-CLOTHING                         26.24
Tribold                 /ORGANIZATION/TRIBOLD                              26.00
ip.access               /ORGANIZATION/IP-ACCESS                            25.00

In [60]:
top_company_investment3 = D3.loc[(D3.main_sector == 'Others')]
top_company_investment3 = top_company_investment3.pivot_table(values = 'raised_amount_usd', index = ['name','permalink'], aggfunc = 'sum').sort_values(by = 'raised_amount_usd',ascending = False)
top_company_investment3[:10]

                                                                                                       raised_amount_usd
name                                               permalink
FirstCry.com                                       /ORGANIZATION/FIRSTCRY-COM                                       39.0
Myntra                                             /ORGANIZATION/MYNTRA                                             38.0
CommonFloor                                        /ORGANIZATION/COMMONFLOOR                                        32.9
Pepperfry.com                                      /ORGANIZATION/PEPPERFRY-COM                                      28.0
ItzCash Card Ltd.                                  /ORGANIZATION/ITZCASH-CARD-LTD                                   25.0
NxtGen Data Center & Cloud Services                /ORGANIZATION/NXTGEN-DATA-CENTER-CLOUD-SERVICES                  22.3
Maharana Infrastructure and Professional Servic... /ORGANIZATION/MAHARANA-INFRASTRUCTURE-AND-PROFE...               21.6
Comat Technologies                                 /ORGANIZATION/COMAT-TECHNOLOGIES                                 21.0
CaratLane                                          /ORGANIZATION/CARATLANE                                          21.0
Roposo                                             /ORGANIZATION/ROPOSO                                             20.0

##### second best sector count-wise, which company received the highest investment?

In [61]:
top2_company_investment1 = D1.loc[(D1.main_sector == 'Social, Finance, Analytics, Advertising')]
top2_company_investment1 = top2_company_investment1.pivot_table(values = 'raised_amount_usd', index =['name','permalink'], aggfunc = 'sum').sort_values(by = 'raised_amount_usd',ascending = False)
top2_company_investment1[:5]

                                                           raised_amount_usd
name                            permalink
SST Inc. (Formerly ShotSpotter) /ORGANIZATION/SHOTSPOTTER              67.93
Demandbase                      /ORGANIZATION/DEMANDBASE               63.00
Intacct                         /ORGANIZATION/INTACCT                  61.80
NetBase Solutions               /ORGANIZATION/NETBASE                  60.60
Lotame                          /ORGANIZATION/LOTAME                   59.70

In [62]:
top2_company_investment2 = D2.loc[(D2.main_sector == 'Social, Finance, Analytics, Advertising')]
top2_company_investment2 = top2_company_investment2.pivot_table(values = 'raised_amount_usd', index =['name','permalink'], aggfunc = 'sum').sort_values(by = 'raised_amount_usd',ascending = False)
top2_company_investment2[:5]

                                                           raised_amount_usd
name                  permalink
Celltick Technologies /ORGANIZATION/CELLTICK-TECHNOLOGIES              37.50
myThings              /ORGANIZATION/MYTHINGS                           34.00
Zopa                  /ORGANIZATION/ZOPA                               32.90
VisualDNA             /ORGANIZATION/IMAGINI                            28.55
MarketInvoice         /ORGANIZATION/MARKETINVOICE                      25.55

In [63]:
top2_company_investment3 = D3.loc[(D3.main_sector == 'Social, Finance, Analytics, Advertising')]
top2_company_investment3 = top2_company_investment3.pivot_table(values = 'raised_amount_usd', index =['name','permalink'], aggfunc = 'sum').sort_values(by = 'raised_amount_usd',ascending = False)
top2_company_investment3[:5]

                                                                     raised_amount_usd
name                       permalink
Manthan Systems            /ORGANIZATION/MANTHAN-SYSTEMS                         50.70
Komli Media                /ORGANIZATION/KOMLI-MEDIA                             28.00
ShopClues.com              /ORGANIZATION/SHOPCLUES-COM                           25.00
inTarvo                    /ORGANIZATION/INTARVO                                 21.90
Grameen Financial Services /ORGANIZATION/GRAMEEN-FINANCIAL-SERVICES              21.56

In [64]:
master_frame.to_csv('master_frame_csv',sep = '\t',encoding = 'utf-8',index= False)